{
  "backend/main.mo": "Implements backend actor handling per‑user chat sessions by mode, user profile storage, and access control using authorization mixins.",
  "feature_evidence.json": "Contains feature-to-file mapping evidence for implemented requirements across study modes and chat UI components.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries of major frontend files for documentation or build tooling.",
  "frontend/index.css": "Defines global Tailwind CSS variables and theme settings, including light and dark mode color scales.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads the main script.",
  "frontend/src/App.tsx": "Root React component that manages mode selection and displays either the home page or the chat interface.",
  "frontend/src/components/auth/LoginButton.tsx": "UI button handling Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated first‑time users to save their name before using the app.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat input component with textarea and send button, supporting Enter‑to‑send behavior.",
  "frontend/src/components/chat/ChatPage.tsx": "Full chat UI for a selected mode, including thread display, quick prompts, sending messages, and clearing history.",
  "frontend/src/components/chat/ChatThread.tsx": "Renders a list of chat messages with user/assistant styling and avatars.",
  "frontend/src/components/chat/QuickPrompts.tsx": "Displays mode-specific quick prompt buttons that trigger onPromptClick.",
  "frontend/src/components/layout/SchoolLayout.tsx": "Provides the main app layout with header, footer, and background styling for school theme.",
  "frontend/src/components/modes/modeTypes.ts": "Defines mode metadata and quick prompt lists returned based on the selected Mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useChat.ts": "Handles chat state, history loading, message sending, and error management per mode.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and saves the caller's user profile using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark school-themed design.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with selectable mode cards for different study subjects.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL and sessionStorage parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for a themed UI.",
  "project_state.json": "Stores project metadata, feature descriptions, image requirements, and current application state for planning."
}